# AlignmentStationPrefix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlignmentStationPrefix Property
ParameterTypeId Class See Also
---
"Station Prefix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlignmentStationPrefix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlignmentStationPrefix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlignmentStationPrefix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace